# This is a standard set of tools, installable on just about any Mac you use
# To install personal apps (not on a work machine), run `brew bundle --file .Brewfile.personal`
#
# Core setup
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "buo/cask-upgrade"    # upgrade cask installed apps via `brew cu`
tap "homebrew/cask-fonts"
brew "coreutils"

# deps?
brew "cmake"
brew "curl"
brew "libidn2"
brew "gnutls"
brew "gnupg"
brew "openssl@3"
brew "sqlite"

# git and github
brew "gh"
brew "git"
brew "git-lfs"

# handy tools
brew "asdf"
brew "heroku/brew/heroku"
brew "jq"
brew "pandoc"
brew "tcptraceroute"
brew "tldr"
brew "tmux"
brew "watchman"
brew "wget"
brew "starship"
brew "exa"
brew "ripgrep"
brew "fzf"

# Mac apps, sideloaded
cask "alfred"
cask "bbedit"
cask "iterm2"
cask "macvim"
cask "nova"
cask "visual-studio-code"

# fonts!
cask "font-sauce-code-pro-nerd-font"
cask "font-league-gothic"
