# This is a standard set of tools, installable on just about any Mac you use
# To install personal apps (not on a work machine), run `brew bundle --file .Brewfile.personal`
#
# Core setup
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "buo/cask-upgrade"    # upgrade cask installed apps via `brew cu`
tap "homebrew/cask-fonts"
brew "coreutils"

# deps?
brew "cmake"
brew "curl"
brew "libidn2"
brew "gnutls"
brew "gnupg"
brew "openssl@3"
brew "sqlite"

# git and github
brew "gh"
brew "git"
brew "git-lfs"

# handy tools
brew "eza"
brew "fzf"
brew "jq"
brew "lima"
brew "llm"
brew "macvim"
brew "pandoc"
brew "ripgrep"
brew "starship"
brew "tcptraceroute"
brew "tldr"
brew "tmux"
brew "uv"
brew "wget"
brew "yt-dlp"

# Mac apps, sideloaded
# Upgrade with `brew cu -a --interactive`
cask "bbedit"
cask "iterm2"
cask "nova"
cask "obsidian"
cask "raycast"
cask "safari-technology-preview"
cask "utm"
cask "visual-studio-code"

# fonts!
cask "font-sauce-code-pro-nerd-font"
cask "font-league-gothic"
cask "font-monaspace-nerd-font"
